In [31]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [32]:
data = pd.read_csv('Salary_Data.csv')
data

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [33]:
data.isnull().sum()

Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

In [34]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

In [35]:
data.nunique()

Age                     41
Gender                   3
Education Level          7
Job Title              193
Years of Experience     37
Salary                 444
dtype: int64

In [36]:
Numerical_col=[]
Categorical_col=[]
for feature in data.columns:
    if data[feature].dtype!="object":
        Numerical_col.append(feature)
    else:
        Categorical_col.append(feature)

print(Categorical_col)
print(Numerical_col)

['Gender', 'Education Level', 'Job Title']
['Age', 'Years of Experience', 'Salary']

In [37]:
for column in Numerical_col:
    Q1 = data[column].quantile(0.25)
    Q3 = data[column].quantile(0.75)
    IQR = Q3 - Q1

    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR

    outliers = (data[column] < lower_bound) | (data[column] > upper_bound)
    
    data = data[~outliers]

In [38]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
for col in Categorical_col:
    data[col] = label_encoder.fit_transform(data[[col]])

C:\Users\ACER\AppData\Roaming\Python\Python311\site-packages\sklearn\preprocessing\_label.py:114: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\ACER\AppData\Roaming\Python\Python311\site-packages\sklearn\preprocessing\_label.py:114: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\ACER\AppData\Roaming\Python\Python311\site-packages\sklearn\preprocessing\_label.py:114: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [39]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

columns_normalize = ['Salary']
for col in columns_normalize:
    data[col] = scaler.fit_transform(data[[col]])

In [40]:
data = data.drop_duplicates()

In [41]:
data.duplicated().sum()

0

In [42]:
data.isnull().sum()

Age                    1
Gender                 0
Education Level        0
Job Title              0
Years of Experience    2
Salary                 4
dtype: int64

In [43]:
data = data.dropna()

In [44]:
data

       Age  Gender  Education Level  Job Title  Years of Experience    Salary
0     32.0       1                0        177                  5.0 -0.453445
1     28.0       0                3         18                  3.0 -0.933273
2     45.0       1                5        145                 15.0  0.698142
3     36.0       0                0        116                  7.0 -1.029239
4     52.0       1                3         26                 20.0  1.657799
...    ...     ...              ...        ...                  ...       ...
6623  43.0       0                4         24                 15.0  0.698142
6624  27.0       1                2        119                  2.0 -1.413102
6625  33.0       0                1         34                  8.0 -0.645377
6628  37.0       1                1        117                  7.0 -0.453445
6631  30.0       0                1        119                  5.0 -0.837308

[1727 rows x 6 columns]

In [45]:
data.to_csv('Bebas.csv', index=False)